5t31thphoto/fox_s3/firmware/sdkconfig.defaults
# ---- Target / flash ----
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# ---- PSRAM (AtomS3R has 8MB octal PSRAM) ----
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---- CPU / power ----
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# ---- Arduino ----
# AUTOSTART must be OFF: we define app_main() ourselves in fox_main.cpp and run
# setup()/loop() in a task we control. Relying on autostart did NOT call setup()
# in this managed-component setup (app_main returned, black screen forever).
CONFIG_AUTOSTART_ARDUINO=n
CONFIG_ARDUINO_LOOP_STACK_SIZE=32768

# ---- esp-sr: MultiNet7 English, no wake word (PTT only) ----
CONFIG_SR_MN_ENGLISH=y
CONFIG_SR_MN_EN_MULTINET7_QUANT=y
CONFIG_MODEL_IN_SPIFFS=y
# We deliberately do NOT enable any WakeNet model: interaction is push-to-talk.
CONFIG_SR_WN_NONE=y

# ---- USB: use the native USB-Serial-JTAG (what the AtomS3R hardware + factory
# firmware use). Do NOT force TinyUSB CDC for the IDF console — on the S3 that
# contends with Arduino's USB stack over the single USB PHY and can stall
# initArduino()/Serial (symptom: dead after "Returned from app_main()", no
# serial, black screen). Arduino's Serial (HWCDC) and the IDF console then share
# the same USB-Serial-JTAG peripheral cleanly. The web-flasher config handshake
# still works over this port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ARDUINO_USB_CDC_ON_BOOT=1

# ---- misc ----
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_COMPILER_OPTIMIZATION_SIZE=y


# ---- Bluetooth LE (ESP32-S3 is BLE-only in hardware; no Classic BT) ----
# Arduino's BLEDevice.h uses Bluedroid. These are the correct S3 keys.
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTS_ENABLE=y
CONFIG_BT_GATTC_ENABLE=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# ---- WiFi + BLE coexistence (both radios share one antenna on the S3) ----
# The tools run one at a time (menu-driven), but enabling software coexistence
# means even concurrent use is arbitrated by the controller instead of
# conflicting. This is the proper fix — not disabling a radio.
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
CONFIG_ESP_WIFI_SW_COEXIST_ENABLE=y

# ---- Warnings: keep them visible but don't let the GCC-13 additions (e.g.
# dangling-reference) hard-stop the build. The IDF-sanctioned switch. ----
CONFIG_COMPILER_DISABLE_GCC12_WARNINGS=y
CONFIG_COMPILER_DISABLE_GCC13_WARNINGS=y

# ---- mbedTLS PSK ciphersuites: REQUIRED for arduino-esp32's WiFiClientSecure/
# NetworkClientSecure to LINK. Without these, ssl_client.cpp wraps its entire
# body in `#if defined(...PSK...) #else #warning #endif`, so start_ssl_client /
# stop_ssl_socket / ssl_init etc. are compiled out -> "undefined reference" at
# link. Enabling PSK modes defines MBEDTLS_KEY_EXCHANGE__SOME__PSK_ENABLED and
# the real function bodies get built. (This is the documented fix; the earlier
# build even emitted the #warning pointing right at it.)
CONFIG_MBEDTLS_PSK_MODES=y
CONFIG_MBEDTLS_KEY_EXCHANGE_PSK=y
